{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"b9b041cc-d5bb-46b5-b3ef-33122f2cdd47":{"type":"rich-text","blocks":{"template--18221109739837__b9b041cc-d5bb-46b5-b3ef-33122f2cdd47-1685668457a5476d46-0":{"type":"heading","settings":{"heading":"<p>About Us<\/p>","heading_size":"h1"}},"template--18221109739837__b9b041cc-d5bb-46b5-b3ef-33122f2cdd47-1685668457a5476d46-1":{"type":"text","settings":{"text":"<p>Welcome to Fluff & Fold, a family-owned business in Las Vegas! As lifelong residents of this city, we understand how busy and fast-paced life can be here. That's why we started this business - to provide our fellow locals with convenient and reliable laundry pickup and delivery services.<\/p><p>Our mission is simple: to make your life easier by taking care of your laundry needs. We know that laundry can be a tedious and time-consuming task, especially when you have a family and a busy schedule. Let us take that burden off your shoulders and give you back some valuable time in your day.<\/p><p>We're committed to providing exceptional service and treating your laundry with the utmost care. Our team of experienced professionals will handle your clothes and linens with precision, using only the best laundry products and techniques to ensure that they come back to you looking and smelling great.<\/p><p>At Fluff & Fold, we pride ourselves on building relationships with our customers. We believe that by providing personalized service and treating you like family, we can create a loyal and happy customer base. We'll work with you to schedule pickups and deliveries at times that are convenient for you, and we're always available to answer any questions or address any concerns you may have.<\/p><p>Thank you for choosing Fluff & Fold for your laundry needs. We're proud to serve our fellow Las Vegans and look forward to building a long-lasting relationship with you.<\/p>"}},"template--18221109739837__b9b041cc-d5bb-46b5-b3ef-33122f2cdd47-1685668457a5476d46-2":{"type":"button","settings":{"button_label":"","button_link":"","button_style_secondary":false,"button_label_2":"","button_link_2":"","button_style_secondary_2":false}}},"block_order":["template--18221109739837__b9b041cc-d5bb-46b5-b3ef-33122f2cdd47-1685668457a5476d46-0","template--18221109739837__b9b041cc-d5bb-46b5-b3ef-33122f2cdd47-1685668457a5476d46-1","template--18221109739837__b9b041cc-d5bb-46b5-b3ef-33122f2cdd47-1685668457a5476d46-2"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"accent-1","full_width":true,"padding_top":40,"padding_bottom":52}}},"order":["main","b9b041cc-d5bb-46b5-b3ef-33122f2cdd47"]}